my_list = ["Konstantin", "Zhenya", "Emil", 5, 28, 27, 5]

#my_list.sort(reverse=True)     # Не работи с лист, който съдържа едновременно и String и Integer. Трябва да е или едното или другото.
#print(my_list)                # когато е само sort() автоматично ги подрежда по големина във възходящ ред, ако е sort(reverse=True) ги нарежда по големи в низходящ ред.

#my_list.pop()                  # Взима последния елемент от листа и го изтрива.
#print(my_list)

#my_list.pop(2)                 # По този начин можем директно да трием по ИНДЕКС елемент от листа
#print(my_list)
#print(my_list.pop(2))          # елемента, който е изтрит от листа е запазена, връща се стойността на елемнта. Ако примерно в същия случай използваме remove то ние безвъзвратно ще изтрием дадения елемент.

#my_list.insert(index, element)   # На индекса, който въведем ще се постави елемента, който сложим - strin, int, или друг елемент. Ако сложим елемент по-голямо число от броя на елементи в листа то Python атвоматично ще го appndne(добави) като последен елемент
#print(my_list)

#number = my_list.index("Zhenya")   #за аргумент можем да въведем елемент от листа и ще ни върне на кой индекс се намира в листа. Ако елемента, който задаваме го няма в листа ще получим грешка
#print(number)

#repetition = my_list.count("Zhenya")        # Показва колко пъти се съдържа аргумента(елемента), който сме въвели в листа.
#print(repetition)

#my_list.reverse()                             # Обръща ни листа обратно№
#print(my_list)
#print(my_list[::-1])                           # Извършва същата функция

#del my_list[3]                                  #Изтрива елемент от листа
#print(my_list)

#my_list.remove("Emil")                            #Изтрива елемента, който сме задали
#print(my_list)